SELECT * FROM java505_team4_db.food_months;

-- Ai(자동 증가열) 시작 위치 설정 (현재는 1부터 시작하게 설정함)
ALTER table food_months auto_increment = 1;

-- TABLE 내용 전체 삭제
TRUNCATE food_months;

-- 테스트용 데이터
-- Insert into 
-- 	food_months(foodm_name, foodm_month)
-- VALUES 
-- 	('만두', '1월'),
--     ('장아찌', '1월'),
-- 	('대두', '2월'),
-- 	('깻잎', '2월'),
-- 	('보리', '3월'),
-- 	('양배추', '3월'),
-- 	('미나리', '4월'),
-- 	('녹두', '4월'),
-- 	('수수', '5월'),
-- 	('시금치', '5월'),
-- 	('양파', '6월'),
-- 	('달걀', '6월'),
-- 	('옥수수', '7월'),
-- 	('애호박', '7월'),
-- 	('고추', '8월'),
-- 	('포도', '8월'),
-- 	('배', '9월'),
-- 	('자두', '9월'),
-- 	('새송이', '10월'),
-- 	('현미', '10월'),
-- 	('잣', '11월'),
-- 	('감', '11월'),
-- 	('밤', '12월'),
-- 	('동치미', '12월');

Insert into 
	food_months(foodm_name, foodm_month)
VALUES 
	('만두', '1월'), ('우리밀', '1월'), ('장아찌', '1월'), ('찹쌀', '1월'), ('곶감', '1월'), ('더덕', '1월'), ('오곡', '1월'),('토란대', '1월'),
	('한라봉', '1월'), ('들깨', '1월'), ('귤', '1월'), ('미나리', '1월'), ('도라지', '1월'),
	('대두', '2월'), ('깻잎', '2월'), ('요거트', '2월'), ('가래떡', '2월'), ('건대추', '2월'), ('고사리', '2월'), ('조', '2월'), ('건과일', '2월'),
	('딸기', '2월'), ('봄동', '2월'), ('시래기', '2월'), ('우엉', '2월'),
	('목이버섯', '3월'), ('새싹', '3월'), ('보리', '3월'), ('견과류', '3월'), ('양배추', '3월'), ('움파', '3월'), ('당면', '3월'), ('묵은나물', '3월'),
	('풋마늘', '3월'), ('방울토마토', '3월'), ('냉이', '3월'), ('닭가슴살/닭안심', '3월'),
	('미나리', '4월'), ('식용꽃', '4월'), ('발효생행', '4월'), ('녹두', '4월'), ('머위순', '4월'), ('오리고기', '4월'), ('달래', '4월'), ('기장', '4월'),
	('돼지고기(수제 소시지)', '4월'), ('쑥', '4월'), ('흑미', '4월'), ('돼지고기', '4월'),
	('수수', '5월'), ('시금치', '5월'), ('스트링치즈', '5월'), ('두부', '5월'), ('죽순', '5월'), ('참외', '5월'), ('귀리', '5월'), ('상추', '5월'),
	('토마토', '5월'), ('두릅', '5월'), ('오리고기', '5월'), ('기장', '5월'), ('마늘', '5월'), ('오이', '5월'), ('돼지고기', '5월'),
	('곤드레', '6월'), ('산딸기', '6월'), ('오리고기', '6월'), ('강낭콩', '6월'), ('양파', '6월'), ('달걀', '6월'), ('보리', '6월'), ('가지', '6월'),
	('달고기', '6월'), ('오디', '6월'), ('리코타치즈', '6월'), ('율무', '6월'), ('감자', '6월'),
	('옥수수', '7월'), ('복숭아', '7월'), ('열무', '7월'), ('우리밀', '7월'), ('애호박', '7월'), ('닭가슴살/닭안심', '7월'), ('인삼(수삼)', '7월'), 		
    ('콩나물', '7월'), ('참외', '7월'), ('우유', '7월'), ('보리쌀', '7월'), ('수박', '7월'), ('닭고기', '7월'),
	('고추', '8월'), ('멜론', '8월'), ('닭가슴살/닭안심', '8월'), ('풋콩', '8월'), ('참나물', '8월'), ('포도', '8월'), ('들깨', '8월'), ('블루베리', '8월'),
	('연근', '8월'), ('메밀', '8월'), ('고구마순', '8월'), ('복숭아', '8월'), ('대두', '8월'), ('기장', '9월'), ('배', '9월'), ('표고버섯', '9월'),
	('율무', '9월'), ('무화과', '9월'), ('소고기', '9월'), ('수수', '9월'), ('자두', '9월'), ('팽이버섯', '9월'), ('쇠고기', '9월'), ('포도', '9월'),
	('사과', '9월'), ('토란', '9월'), ('녹두', '9월'),
	('쌀', '10월'), ('참다래', '10월'), ('파김치', '10월'), ('고춧잎', '10월'), ('새송이', '10월'), ('현미', '10월'), ('도라지', '10월'), ('사과', '10월'),
	('검은콩', '10월'), ('배', '10월'), ('표고버섯', '10월'), ('호박', '10월'), ('연근', '10월'),
	('잣', '11월'), ('감', '11월'), ('늙은 호박', '11월'), ('메밀', '11월'), ('배추', '11월'), ('돼지고기', '11월'), ('단호박', '11월'), ('대추', '11월'),
	('무', '11월'), ('유자', '11월'), ('쌀', '11월'),
	('밤', '12월'), ('동치미', '12월'), ('석류', '12월'), ('도토리', '12월'), ('모과', '12월'), ('브루콜리', '12월'), ('팥', '12월'), ('귤', '12월'),
	('생강', '12월'), ('참다래', '12월'), ('동부', '12월'), ('시금치', '12월'), ('고구마', '12월'), ('쇠고기', '12월');

Select 
	foodm_name
from 
	food_months
where foodm_month = '12월';

Select 
	foodm_name
from 
	food_months
where foodm_month = '12월'
and foodm_name = '밤';

select foodm_name, foodm_month
From food_months
Where foodm_name like '%리%';
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    